In [ ]:
import pandas as pd

In [ ]:
df= pd.read_csv("http://bit.ly/2cLzoxH")

In [ ]:
df.sort_values('lifeExp',na_position='first')

              country  year          pop continent  lifeExp     gdpPercap
1292           Rwanda  1992    7290203.0    Africa   23.599    737.068595
0         Afghanistan  1952    8425333.0      Asia   28.801    779.445314
552            Gambia  1952     284320.0    Africa   30.000    485.230659
36             Angola  1952    4232095.0    Africa   30.015   3520.610273
1344     Sierra Leone  1952    2143249.0    Africa   30.331    879.787736
...               ...   ...          ...       ...      ...           ...
1487      Switzerland  2007    7554661.0    Europe   81.701  37506.419070
695           Iceland  2007     301931.0    Europe   81.757  36180.789190
802             Japan  2002  127065841.0      Asia   82.000  28604.591900
671   Hong Kong China  2007    6980412.0      Asia   82.208  39724.978670
803             Japan  2007  127467972.0      Asia   82.603  31656.068060

[1704 rows x 6 columns]

In [ ]:
df.sort_values(['country','lifeExp'],ascending=[True,False])

          country  year         pop continent  lifeExp   gdpPercap
11    Afghanistan  2007  31889923.0      Asia   43.828  974.580338
10    Afghanistan  2002  25268405.0      Asia   42.129  726.734055
9     Afghanistan  1997  22227415.0      Asia   41.763  635.341351
8     Afghanistan  1992  16317921.0      Asia   41.674  649.341395
7     Afghanistan  1987  13867957.0      Asia   40.822  852.395945
...           ...   ...         ...       ...      ...         ...
1693     Zimbabwe  1957   3646340.0    Africa   50.469  518.764268
1692     Zimbabwe  1952   3080907.0    Africa   48.451  406.884115
1701     Zimbabwe  1997  11404948.0    Africa   46.809  792.449960
1703     Zimbabwe  2007  12311143.0    Africa   43.487  469.709298
1702     Zimbabwe  2002  11926563.0    Africa   39.989  672.038623

[1704 rows x 6 columns]

In [ ]:
df.round({'lifeExp':2})

          country  year         pop continent  lifeExp   gdpPercap
0     Afghanistan  1952   8425333.0      Asia    28.80  779.445314
1     Afghanistan  1957   9240934.0      Asia    30.33  820.853030
2     Afghanistan  1962  10267083.0      Asia    32.00  853.100710
3     Afghanistan  1967  11537966.0      Asia    34.02  836.197138
4     Afghanistan  1972  13079460.0      Asia    36.09  739.981106
...           ...   ...         ...       ...      ...         ...
1699     Zimbabwe  1987   9216418.0    Africa    62.35  706.157306
1700     Zimbabwe  1992  10704340.0    Africa    60.38  693.420786
1701     Zimbabwe  1997  11404948.0    Africa    46.81  792.449960
1702     Zimbabwe  2002  11926563.0    Africa    39.99  672.038623
1703     Zimbabwe  2007  12311143.0    Africa    43.49  469.709298

[1704 rows x 6 columns]

In [ ]:
df = pd.DataFrame({'population': [58812491, 37522972, 339757,
                                  339757, 339757, 38964, 11646, 11646, 11646],
                   'GDP': [2033594, 1833594 , 153594, 14520, 10128,
                           836, 139, 39, 539],
                   'alpha-2': ["SA", "CA", "AU", "MV", "IS",
                               "MC", "NU", "TV", "PW"]},
                  index=["South Africa", "Canada", "Australia",
                         "Maldives", "Iceland", "Monaco", "Niue",
                         "Tuvalu", "Palau"])

In [ ]:
df

              population      GDP alpha-2
South Africa    58812491  2033594      SA
Canada          37522972  1833594      CA
Australia         339757   153594      AU
Maldives          339757    14520      MV
Iceland           339757    10128      IS
Monaco             38964      836      MC
Niue               11646      139      NU
Tuvalu             11646       39      TV
Palau              11646      539      PW

In [ ]:
df.nlargest(3,'population')

              population      GDP alpha-2
South Africa    58812491  2033594      SA
Canada          37522972  1833594      CA
Australia         339757   153594      AU

In [ ]:
df.nlargest(3,'population',keep='last')

              population      GDP alpha-2
South Africa    58812491  2033594      SA
Canada          37522972  1833594      CA
Iceland           339757    10128      IS

takes the last one among the equal values

In [ ]:
df.nlargest(3,'population',keep='all')

              population      GDP alpha-2
South Africa    58812491  2033594      SA
Canada          37522972  1833594      CA
Australia         339757   153594      AU
Maldives          339757    14520      MV
Iceland           339757    10128      IS

In [ ]:
df.nsmallest(3,'population',keep='all')

        population  GDP alpha-2
Niue         11646  139      NU
Tuvalu       11646   39      TV
Palau        11646  539      PW

In [ ]:
df.nsmallest(3,'population',keep='all')

        population  GDP alpha-2
Niue         11646  139      NU
Tuvalu       11646   39      TV
Palau        11646  539      PW

In [ ]:
df=pd.read_csv("https://archive.ics.uci.edu/ml/machine-learning-databases/wine-quality/winequality-red.csv",sep=';')

In [ ]:
df

      fixed acidity  volatile acidity  citric acid  ...  sulphates  alcohol  quality
0               7.4             0.700         0.00  ...       0.56      9.4        5
1               7.8             0.880         0.00  ...       0.68      9.8        5
2               7.8             0.760         0.04  ...       0.65      9.8        5
3              11.2             0.280         0.56  ...       0.58      9.8        6
4               7.4             0.700         0.00  ...       0.56      9.4        5
...             ...               ...          ...  ...        ...      ...      ...
1594            6.2             0.600         0.08  ...       0.58     10.5        5
1595            5.9             0.550         0.10  ...       0.76     11.2        6
1596            6.3             0.510         0.13  ...       0.75     11.0        6
1597            5.9             0.645         0.12  ...       0.71     10.2        5
1598            6.0             0.310         0.47  ...       0.66     11.0        6

[1599 rows x 12 columns]

In [ ]:
df.iloc[:,[3,4,6]].head()

   residual sugar  chlorides  total sulfur dioxide
0             1.9      0.076                  34.0
1             2.6      0.098                  67.0
2             2.3      0.092                  54.0
3             1.9      0.075                  60.0
4             1.9      0.076                  34.0

In [ ]:
df.iloc[[4,8],[7,9]]

   density  sulphates
4   0.9978       0.56
8   0.9968       0.57

In [ ]:
df.loc[((df['fixed acidity']>5)&(df['residual sugar']<2))]

      fixed acidity  volatile acidity  citric acid  ...  sulphates  alcohol  quality
0               7.4              0.70         0.00  ...       0.56      9.4        5
3              11.2              0.28         0.56  ...       0.58      9.8        6
4               7.4              0.70         0.00  ...       0.56      9.4        5
5               7.4              0.66         0.00  ...       0.56      9.4        5
6               7.9              0.60         0.06  ...       0.46      9.4        5
...             ...               ...          ...  ...        ...      ...      ...
1581            6.2              0.56         0.09  ...       0.60     11.3        5
1587            5.8              0.61         0.11  ...       0.66     10.9        6
1590            6.3              0.55         0.15  ...       0.82     11.6        6
1591            5.4              0.74         0.09  ...       0.56     11.6        6
1593            6.8              0.62         0.08  ...       0.82      9.5        6

[460 rows x 12 columns]

In [ ]:
df.loc[((df['fixed acidity']>5)|(df['residual sugar']<2))]['density'].sum()

1588.8379

In [ ]:
import pandas as pd

In [ ]:
df=pd.read_csv("https://amritavishwavidyapeetham.sharepoint.com/sites/B.Tech.2018.R.CSE.1.15CSE431/Shared%20Documents/General/weather_by_cities.csv")

HTTPError: ignored

In [ ]:
from google.colab import drive
drive.mount("/content/drive")

In [ ]:
df=pd.read_csv('/content/drive/My Drive/DS/6thaug/weather_by_cities.csv')

In [ ]:
df

In [ ]:
g=df.groupby('city')

In [ ]:
g.get_group('new york')

In [ ]:
g.max()

In [ ]:
g.mean()

In [ ]:
g.describe()

In [ ]:
g.size()

In [ ]:
g.count()

separately for all rows

In [ ]:
df = pd.DataFrame({
    'user_id':[1,2,1,3,3,],
    'content_id':[1,1,2,2,2],
    'tag':['cool','nice','clever','clever','not-bad']
})

In [ ]:
df

In [ ]:
df.groupby("content_id")['tag'].apply(lambda tags:','.join(tags))

In [ ]:
df.groupby('content_id')['user_id'].nunique()

size of unique element list

In [ ]:
df.groupby('content_id')['user_id'].nunique().to_frame()

In [ ]:
df.groupby('content_id')['user_id'].nunique().to_frame().reset_index()

In [ ]:
df.groupby('content_id')['user_id'].nunique().to_frame().reset_index(drop=True)

In [ ]:
df = pd.DataFrame({
    'value':[20.45,22.89,32.12,111.22,33.22,100.00,99.99],
    'product':['table','chair','chair','mobile phone','table','mobile phone','table']
})

In [ ]:
df

In [ ]:
df1=df.groupby('product')['value'].sum().to_frame().reset_index()

put sum of values in each group and createsa df with groups and sum values

In [ ]:
df1

In [ ]:
df2=df1.sort_values('value')

In [ ]:
df2

In [ ]:
import matplotlib.pyplot as plt

In [ ]:
%matplotlib inline

In [ ]:
df.groupby('product').size().plot()

In [ ]:
df.groupby('product').size().plot(kind='bar')

In [ ]:
df.groupby('product').sum().plot(kind='bar')

In [ ]:
df = pd.DataFrame({
    'value':[20.45,22.89,32.12,111.22,33.22,100.00,99.99],
    'product':['table','chair','chair','mobile phone','table','mobile phone','table'],
    'val':[10,20,30,40,50,60,70],
    'str':['a','b','c','d','e','f','a']
})
df.groupby('product').sum().plot(kind='bar')
plt.show()

In [ ]:
df = pd.DataFrame({
    'value':[20.45,22.89,32.12,111.22,33.22,100.00,99.99],
    'product':['table','chair','chair','mobile phone','table','mobile phone','table'],
    'price':[100,200,300,400,500,600,700]
})

In [ ]:
gdf=df.groupby('product').agg({'value':['mean','min','max']})

In [ ]:
gdf

In [ ]:
gdf=df.groupby('product').agg({'value':['min','max'],'price':['mean']})

In [ ]:
gdf

In [ ]:
gdf.columns.values

In [ ]:
grouped_df=df.groupby('product')['value'].sum()

In [ ]:
grouped_df

In [ ]:
grouped_df=df.groupby('product')['value'].sum().reset_index(name='value_sum')

In [ ]:
grouped_df

In [ ]:
tndf=pd.read_csv('https://raw.githubusercontent.com/pcsanwald/kaggle-titanic/master/train.csv')

In [ ]:
tndf

In [ ]:
len(tndf.loc[((tndf['survived']==1)&(tndf['sex']=='female'))])

In [ ]:
gp=tndf.groupby('sex')

In [ ]:
(gp.get_group('female')['survived']==1).value_counts()

In [ ]:
gp.head()

import pandas as pd

In [ ]:
import pandas as pd

In [ ]:
def make_df(cols, ind):
    """Quickly make a DataFrame"""
    data = {c: [str(c) + str(i) for i in ind]
            for c in cols}
    return pd.DataFrame(data, ind)

# example DataFrame
make_df('ABC', range(3))


class display(object):
    """Display HTML representation of multiple objects"""
    template = """<div style="float: left; padding: 10px;">
    <p style='font-family:"Courier New", Courier, monospace'>{0}</p>{1}
    </div>"""
    def _init_(self, *args):
        self.args = args
        
    def repr_html(self):
        return '\n'.join(self.template.format(a, eval(a).repr_html())
                         for a in self.args)
    
    def _repr_(self):
        return '\n\n'.join(a + '\n' + repr(eval(a))
                           for a in self.args)
df1 = pd.DataFrame({'employee': ['Bob', 'Jake', 'Lisa', 'Sue'],'group': ['Accounting', 'Engineering', 'Engineering', 'HR']})



df2 = pd.DataFrame({'employee': ['Lisa', 'Bob', 'Jake', 'Sue'],'hire_date': [2004, 2008, 2012, 2014]})



df4 = pd.DataFrame({'group': ['Accounting', 'Engineering', 'HR'],'supervisor': ['Carly', 'Guido', 'Steve']})


df5 = pd.DataFrame({'group': ['Accounting', 'Accounting','Engineering', 'Engineering', 'HR', 'HR'],'skills': ['math', 'spreadsheets', 'coding', 'linux', 'spreadsheets', 'organization']})



df3 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'],'salary': [70000, 80000, 120000, 90000]})


df6 = pd.DataFrame({'name': ['Peter', 'Paul', 'Mary'],'food': ['fish', 'beans', 'bread']},columns=['name', 'food'])
df7 = pd.DataFrame({'name': ['Mary', 'Joseph'],
                    'drink': ['wine', 'beer']},
                   columns=['name', 'drink'])



df8 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'],'rank': [1, 2, 3, 4]})


df9 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'],'rank': [3, 1, 4, 2]})

In [ ]:
df1

In [ ]:
df1=make_df('AB',[1,2])
df2=make_df('AB',[3,4])
pd.concat([df1,df2])

    A   B
1  A1  B1
2  A2  B2
3  A3  B3
4  A4  B4

In [ ]:
df1=make_df('AB',[1,2])
df2=make_df('AB',[3,4])
pd.concat([df1,df2],axis=1)

     A    B    A    B
1   A1   B1  NaN  NaN
2   A2   B2  NaN  NaN
3  NaN  NaN   A3   B3
4  NaN  NaN   A4   B4

In [ ]:
df1=make_df('AB',[1,2])
df2=make_df('AB',[1,2])
pd.concat([df1,df2])

    A   B
1  A1  B1
2  A2  B2
1  A1  B1
2  A2  B2

In [ ]:
df1=make_df('AB',[1,2])
df2=make_df('CD',[3,4])
pd.concat([df1,df2],axis=1)

     A    B    C    D
1   A1   B1  NaN  NaN
2   A2   B2  NaN  NaN
3  NaN  NaN   C3   D3
4  NaN  NaN   C4   D4

In [ ]:
df1=make_df('AB',[1,2])
df2=make_df('CD',[3,4])
pd.concat([df1,df2])

     A    B    C    D
1   A1   B1  NaN  NaN
2   A2   B2  NaN  NaN
3  NaN  NaN   C3   D3
4  NaN  NaN   C4   D4

In [ ]:
df1=make_df('AB',[1,2])
df2=make_df('CB',[3,4])
pd.concat([df1,df2],join='inner')

    B
1  B1
2  B2
3  B3
4  B4

In [ ]:
df1=make_df('AB',[1,2])
df2=make_df('AD',[3,4])
pd.concat([df1,df2],join='outer')

    A    B    D
1  A1   B1  NaN
2  A2   B2  NaN
3  A3  NaN   D3
4  A4  NaN   D4

default outer

In [ ]:
! pip install IPython

Requirement already satisfied: IPython in /usr/local/lib/python3.6/dist-packages (5.5.0)
Requirement already satisfied: setuptools>=18.5 in /usr/local/lib/python3.6/dist-packages (from IPython) (49.2.0)
Requirement already satisfied: prompt-toolkit<2.0.0,>=1.0.4 in /usr/local/lib/python3.6/dist-packages (from IPython) (1.0.18)
Requirement already satisfied: pexpect; sys_platform != "win32" in /usr/local/lib/python3.6/dist-packages (from IPython) (4.8.0)
Requirement already satisfied: pickleshare in /usr/local/lib/python3.6/dist-packages (from IPython) (0.7.5)
Requirement already satisfied: decorator in /usr/local/lib/python3.6/dist-packages (from IPython) (4.4.2)
Requirement already satisfied: simplegeneric>0.8 in /usr/local/lib/python3.6/dist-packages (from IPython) (0.8.1)
Requirement already satisfied: pygments in /usr/local/lib/python3.6/dist-packages (from IPython) (2.1.3)
Requirement already satisfied: traitlets>=4.2 in /usr/local/lib/python3.6/dist-packages (from IPython) (4.3.3)
Requirement already satisfied: six>=1.9.0 in /usr/local/lib/python3.6/dist-packages (from prompt-toolkit<2.0.0,>=1.0.4->IPython) (1.15.0)
Requirement already satisfied: wcwidth in /usr/local/lib/python3.6/dist-packages (from prompt-toolkit<2.0.0,>=1.0.4->IPython) (0.2.5)
Requirement already satisfied: ptyprocess>=0.5 in /usr/local/lib/python3.6/dist-packages (from pexpect; sys_platform != "win32"->IPython) (0.6.0)
Requirement already satisfied: ipython-genutils in /usr/local/lib/python3.6/dist-packages (from traitlets>=4.2->IPython) (0.2.0)

In [ ]:
display(df1)

TypeError: ignored

In [ ]:
df11=make_df('AB',[1,2])
df22=make_df('AD',[2,3])

In [ ]:
df3=pd.merge(df11,df22)

merge...works only with common columns .... and shows onmly common rows

In [ ]:
df3

    A   B   D
0  A2  B2  D2

In [ ]:
df3=pd.merge(df1,df2)

In [ ]:
df1 = pd.DataFrame({'employee': ['Bob', 'Jake', 'Lisa', 'Sue'],'group': ['Accounting', 'Engineering', 'Engineering', 'HR']})



df2 = pd.DataFrame({'employee': ['Lisa', 'Bob', 'Jake', 'Sue'],'hire_date': [2004, 2008, 2012, 2014]})

In [ ]:
df3=pd.merge(df1,df2)

In [ ]:
df3

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

In [ ]:
df1 = pd.DataFrame({'employee': ['Bob', 'Jake', 'Lisa', 'Sue'],'group': ['Accounting', 'Engineering', 'Engineering', 'HR']})



df2 = pd.DataFrame({'employee': ['Lisa', 'Bob', 'Jake', 'Sue'],'hire_date': [2004, 2008, 2012, 2014]})



df4 = pd.DataFrame({'group': ['Accounting', 'Engineering', 'HR'],'supervisor': ['Carly', 'Guido', 'Steve']})


df5 = pd.DataFrame({'group': ['Accounting', 'Accounting','Engineering', 'Engineering', 'HR', 'HR'],'skills': ['math', 'spreadsheets', 'coding', 'linux', 'spreadsheets', 'organization']})



df3 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'],'salary': [70000, 80000, 120000, 90000]})


df6 = pd.DataFrame({'name': ['Peter', 'Paul', 'Mary'],'food': ['fish', 'beans', 'bread']},columns=['name', 'food'])
df7 = pd.DataFrame({'name': ['Mary', 'Joseph'],
                    'drink': ['wine', 'beer']},
                   columns=['name', 'drink'])



df8 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'],'rank': [1, 2, 3, 4]})


df9 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'],'rank': [3, 1, 4, 2]})

In [ ]:
pd.merge(df1,df5)

  employee        group        skills
0      Bob   Accounting          math
1      Bob   Accounting  spreadsheets
2     Jake  Engineering        coding
3     Jake  Engineering         linux
4     Lisa  Engineering        coding
5     Lisa  Engineering         linux
6      Sue           HR  spreadsheets
7      Sue           HR  organization

In [ ]:
df1a=df1.set_index('employee')
df21=df2.set_index('employee')

In [ ]:
pd.merge(df1a,df21)

MergeError: ignored

In [ ]:
df1a=df1.set_index('employee')
df21=df2.set_index('employee')
pd.merge(df1a,df21,left_index=True,right_index=True)

                group  hire_date
employee
Bob        Accounting       2008
Jake      Engineering       2012
Lisa      Engineering       2004
Sue                HR       2014